In [1]:
#Task Create a dict of 10 keys&values Convert that to a df Access 3rd,5th with forward index & last 6 values using reverse

In [17]:
import pandas as pd
import numpy as np
name = ['Kavya', 'Sonal', 'Shubham', 'Shashi','sushma','vinay','mohit','Neyati','Shaurya','Kushagri']
age = [28,30,23,25,26,40,12,5,3,6]
data = {'Name':name,'Age':age}
# creating dictionary
print(data)
# passing dictionary to create dataframe
df = pd.DataFrame(data)
df

{'Name': ['Kavya', 'Sonal', 'Shubham', 'Shashi', 'sushma', 'vinay', 'mohit', 'Neyati', 'Shaurya', 'Kushagri'], 'Age': [28, 30, 23, 25, 26, 40, 12, 5, 3, 6]}

       Name  Age
0     Kavya   28
1     Sonal   30
2   Shubham   23
3    Shashi   25
4    sushma   26
5     vinay   40
6     mohit   12
7    Neyati    5
8   Shaurya    3
9  Kushagri    6

In [19]:
df.loc[[3]]

     Name  Age
3  Shashi   25

In [20]:
df.loc[[5]]

    Name  Age
5  vinay   40

In [21]:
df[-6:]

       Name  Age
4    sushma   26
5     vinay   40
6     mohit   12
7    Neyati    5
8   Shaurya    3
9  Kushagri    6